### Используемое адресное пространство для Loopback интерфейсов, интерлинков

![3-1-2.png](3-1-2.png)
![3-1-3.png](3-1-3.png)
![3-1-4.png](3-1-4.png)

### Используемое адресное пространство для сервисных сетей (на примере VPC)
![3-1-5.png](3-1-5.png)

### IPV6 part
`fc00::/7` — Unique Local Addresses (ULA) — Локальные адреса

Пример: fd12:3456:789a::1/64 (где 12:3456:789a — ваш случайный Global ID).

`prefix+L-bit(8bits):global-id(40bits):subnet-id(16bits)::interface id(64bits)`

Префикс (7 бит): Всегда 1111110 в двоичном виде, что в шестнадцатеричном представляет собой fc или fd.

Бит (L): Определяет, является ли адрес локально назначенным.

    L = 1: Адрес локально назначен. Это и есть тот самый fd00::/8, который мы используем. 
	Это означает, что Global ID был сгенерирован случайным образом.
    
    L = 0: Зарезервировано для будущего использования (fc00::/8). 
	В будущем, возможно, появится центральный орган, который будет выдавать эти префиксы. Сейчас не используется.
	
Global ID (40 бит): Случайно сгенерированный идентификатор, который должен обеспечивать уникальность вашего префикса.

Subnet ID (16 бит): Идентификатор подсети внутри вашей сети. Вы можете использовать его для сегментации сети (например, 0001 для отдела бухгалтерии, 0002 для отдела IT и т.д.). 
                    Это дает вам 65536 возможных подсетей (/64) в рамках одного префикса.
                    
Interface ID (64 бит): Идентификатор интерфейса (хоста), обычно derived из MAC-адреса (EUI-64) или генерируемый случайным образом для конфиденциальности.

#### Возьмем блок: fd12:3456:789a::/48 и поделим на основые задачи:

fd12:3456:789a:000::/64 - loopbacks underlay

fd12:3456:789a:001::/64 - loopbacks overlay

fd12:3456:789a:aaaa::/64 - Service-1

fd12:3456:789a:bbbb::/64 - Service-2

fd12:3456:789a:cccc::/64 - Service-3

fd12:3456:789a:ffff::/64 - PtPs

LLA: fe80::ffff:dddd:0001:0/128


