L-1-2# term length 0
L-1-2# show ip ospf neighbor
 OSPF Process ID 11 VRF default
 Total number of neighbors: 2
 Neighbor ID     Pri State            Up Time  Address         Interface
 10.0.11.1         1 FULL/ -          12:01:40 10.2.1.2        Eth1/2
 10.0.12.1         1 FULL/ -          12:01:24 10.2.2.2        Eth1/3
L-1-2# show ip ospf database
        OSPF Router with ID (10.0.0.12) (Process ID 11 VRF default)

                Router Link States (Area 0.0.0.2)

Link ID         ADV Router      Age        Seq#       Checksum Link Count
10.0.0.12       10.0.0.12       1409       0x8000002d 0xf6ab   5
10.0.11.1       10.0.11.1       1419       0x8000002a 0x14d6   2
10.0.12.1       10.0.12.1       1402       0x8000002a 0x24c2   2

                Summary Network Link States (Area 0.0.0.2)

Link ID         ADV Router      Age        Seq#       Checksum
0.0.0.0         10.0.11.1       1419       0x80000019 0x3dea
0.0.0.0         10.0.12.1       1412       0x80000019 0x36f0

                Type-7 AS External Link States (Area 0.0.0.2)

Link ID         ADV Router      Age        Seq#       Checksum Tag
0.0.0.0         10.0.11.1       1419       0x80000019 0x1192    0
0.0.0.0         10.0.12.1       1412       0x80000019 0x0a98    0
10.9.0.0        10.0.0.12       1499       0x80000019 0x2a65    0
192.168.88.0    10.0.0.12       418        0x80000019 0x24d8    100

L-1-2# show ip ospf interface
 Ethernet1/2 is up, line protocol is up
    IP address 10.2.1.3/31
    Process ID 11 VRF default, area 0.0.0.2
    Enabled by interface configuration
    State P2P, Network type P2P, cost 100
    Index 2, Transmit delay 1 sec
    1 Neighbors, flooding to 1, adjacent with 1
    Timer intervals: Hello 10, Dead 40, Wait 40, Retransmit 5
      Hello timer due in 00:00:04
    Message-digest authentication, using key id 1
    Number of opaque link LSAs: 0, checksum sum 0
    Interface ospf state change count: 3
 Ethernet1/3 is up, line protocol is up
    IP address 10.2.2.3/31
    Process ID 11 VRF default, area 0.0.0.2
    Enabled by interface configuration
    State P2P, Network type P2P, cost 100
    Index 3, Transmit delay 1 sec
    1 Neighbors, flooding to 1, adjacent with 1
    Timer intervals: Hello 10, Dead 40, Wait 40, Retransmit 5
      Hello timer due in 00:00:05
    Message-digest authentication, using key id 1
    Number of opaque link LSAs: 0, checksum sum 0
    Interface ospf state change count: 3
 loopback1 is up, line protocol is up
    IP address 10.0.0.12/32
    Process ID 11 VRF default, area 0.0.0.2
    Enabled by interface configuration
    State LOOPBACK, Network type LOOPBACK, cost 1
    Index 1
L-1-2# show ip route
IP Route Table for VRF "default"
'*' denotes best ucast next-hop
'**' denotes best mcast next-hop
'[x/y]' denotes [preference/metric]
'%<string>' in via output denotes VRF <string>

0.0.0.0/0, ubest/mbest: 2/0
    *via 10.2.1.2, Eth1/2, [110/101], 12:01:37, ospf-11, inter
    *via 10.2.2.2, Eth1/3, [110/101], 12:01:18, ospf-11, inter
10.0.0.12/32, ubest/mbest: 2/0, attached
    *via 10.0.0.12, Lo1, [0/0], 18:10:21, local
    *via 10.0.0.12, Lo1, [0/0], 18:10:21, direct
10.2.1.2/31, ubest/mbest: 1/0, attached
    *via 10.2.1.3, Eth1/2, [0/0], 18:08:42, direct
10.2.1.3/32, ubest/mbest: 1/0, attached
    *via 10.2.1.3, Eth1/2, [0/0], 18:08:42, local
10.2.2.2/31, ubest/mbest: 1/0, attached
    *via 10.2.2.3, Eth1/3, [0/0], 18:08:33, direct
10.2.2.3/32, ubest/mbest: 1/0, attached
    *via 10.2.2.3, Eth1/3, [0/0], 18:08:33, local
10.9.0.0/24, ubest/mbest: 1/0, attached
    *via 10.9.0.1, Vlan9, [0/0], 12:44:32, direct
10.9.0.1/32, ubest/mbest: 1/0, attached
    *via 10.9.0.1, Vlan9, [0/0], 12:44:32, local
192.168.88.0/24, ubest/mbest: 1/0
    *via Null0, [1/0], 11:45:39, static, tag 100

L-1-2#
